app/controllers/songs_controller.rb

  def index
    @songs = Song.order(title: 'asc').page(params[:page])
---
SELECT  "songs".* FROM "songs"  ORDER BY "songs"."title" DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "songs"

  def show
    @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Song 2"], ["artist_id", 1], ["created_at", "2016-01-27 00:20:14.516774"], ["updated_at", "2016-01-27 00:20:14.516774"]]